Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/silex.h
#define SILEX_PK_OPSIZE_OPSIZE_Pos            _UINT32_(0)                                          /* (SILEX_PK_OPSIZE) Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master Position */
#define SILEX_PK_OPSIZE_OPSIZE_Msk            (_UINT32_(0x1FFF) << SILEX_PK_OPSIZE_OPSIZE_Pos)     /* (SILEX_PK_OPSIZE) Operand size (number of bytes): 0x0100: 256 0x0209: 521 0x0800: 2048 0x0C00: 3072 0x1000: 4096 This register is used when the memory is accessed via AHB Master Mask */
#define SILEX_PK_OPSIZE_OPSIZE(value)         (SILEX_PK_OPSIZE_OPSIZE_Msk & (_UINT32_(value) << SILEX_PK_OPSIZE_OPSIZE_Pos)) /* Assigment of value for OPSIZE in the SILEX_PK_OPSIZE register */
#define SILEX_PK_OPSIZE_Msk                   _UINT32_(0x00001FFF)                                 /* (SILEX_PK_OPSIZE) Register Mask  */


/* -------- SILEX_PK_MEMOFFSET : (SILEX Offset: 0x2020) (R/W 32) Memory offset register. -------- */
#define SILEX_PK_MEMOFFSET_RESETVALUE         _UINT32_(0x00)                                       /*  (SILEX_PK_MEMOFFSET) Memory offset register.  Reset Value */

#define SILEX_PK_MEMOFFSET_MEMOFFSET_Pos      _UINT32_(0)                                          /* (SILEX_PK_MEMOFFSET) Memory offset for AHB Master Position */
#define SILEX_PK_MEMOFFSET_MEMOFFSET_Msk      (_UINT32_(0xFFFFFFFF) << SILEX_PK_MEMOFFSET_MEMOFFSET_Pos) /* (SILEX_PK_MEMOFFSET) Memory offset for AHB Master Mask */
#define SILEX_PK_MEMOFFSET_MEMOFFSET(value)   (SILEX_PK_MEMOFFSET_MEMOFFSET_Msk & (_UINT32_(value) << SILEX_PK_MEMOFFSET_MEMOFFSET_Pos)) /* Assigment of value for MEMOFFSET in the SILEX_PK_MEMOFFSET register */
#define SILEX_PK_MEMOFFSET_Msk                _UINT32_(0xFFFFFFFF)                                 /* (SILEX_PK_MEMOFFSET) Register Mask  */


/* -------- SILEX_PK_MICROCODEOFFSET : (SILEX Offset: 0x2024) (R/W 32) MicroCode offset register. -------- */
#define SILEX_PK_MICROCODEOFFSET_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_PK_MICROCODEOFFSET) MicroCode offset register.  Reset Value */

#define SILEX_PK_MICROCODEOFFSET_MICROCODEOFFSET_Pos _UINT32_(0)                                          /* (SILEX_PK_MICROCODEOFFSET) MicroCode offset for AHB Master Position */
#define SILEX_PK_MICROCODEOFFSET_MICROCODEOFFSET_Msk (_UINT32_(0xFFFFFFFF) << SILEX_PK_MICROCODEOFFSET_MICROCODEOFFSET_Pos) /* (SILEX_PK_MICROCODEOFFSET) MicroCode offset for AHB Master Mask */
#define SILEX_PK_MICROCODEOFFSET_MICROCODEOFFSET(value) (SILEX_PK_MICROCODEOFFSET_MICROCODEOFFSET_Msk & (_UINT32_(value) << SILEX_PK_MICROCODEOFFSET_MICROCODEOFFSET_Pos)) /* Assigment of value for MICROCODEOFFSET in the SILEX_PK_MICROCODEOFFSET register */
#define SILEX_PK_MICROCODEOFFSET_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_PK_MICROCODEOFFSET) Register Mask  */


/* -------- SILEX_RNG_DATA_CONTROL : (SILEX Offset: 0x4000) (R/W 32) Control register -------- */
#define SILEX_RNG_DATA_CONTROL_RESETVALUE     _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_CONTROL) Control register  Reset Value */

#define SILEX_RNG_DATA_CONTROL_ENABLE_Pos     _UINT32_(0)                                          /* (SILEX_RNG_DATA_CONTROL) Enable the NDRNG. Position */
#define SILEX_RNG_DATA_CONTROL_ENABLE_Msk     (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_ENABLE_Pos) /* (SILEX_RNG_DATA_CONTROL) Enable the NDRNG. Mask */
#define SILEX_RNG_DATA_CONTROL_ENABLE(value)  (SILEX_RNG_DATA_CONTROL_ENABLE_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_ENABLE_Pos)) /* Assigment of value for ENABLE in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_LFSREN_Pos     _UINT32_(1)                                          /* (SILEX_RNG_DATA_CONTROL) Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1'). Position */
#define SILEX_RNG_DATA_CONTROL_LFSREN_Msk     (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_LFSREN_Pos) /* (SILEX_RNG_DATA_CONTROL) Select between the NDRNG with asynchronous free running oscillators (when '0') and the Pseudo-Random generator with synchronous oscillators for simulation purpose (when '1'). Mask */
#define SILEX_RNG_DATA_CONTROL_LFSREN(value)  (SILEX_RNG_DATA_CONTROL_LFSREN_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_LFSREN_Pos)) /* Assigment of value for LFSREN in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_TESTEN_Pos     _UINT32_(2)                                          /* (SILEX_RNG_DATA_CONTROL) Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode). Position */
#define SILEX_RNG_DATA_CONTROL_TESTEN_Msk     (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_TESTEN_Pos) /* (SILEX_RNG_DATA_CONTROL) Select input for conditioning function and continuous tests: 0: Noise source (normal mode), 1: Test data register (test mode). Mask */
#define SILEX_RNG_DATA_CONTROL_TESTEN(value)  (SILEX_RNG_DATA_CONTROL_TESTEN_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_TESTEN_Pos)) /* Assigment of value for TESTEN in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_CONDBYPASS_Pos _UINT32_(3)                                          /* (SILEX_RNG_DATA_CONTROL) 0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly). Position */
#define SILEX_RNG_DATA_CONTROL_CONDBYPASS_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_CONDBYPASS_Pos) /* (SILEX_RNG_DATA_CONTROL) 0: the conditioning function is used (normal mode), 1: the conditioning function is bypassed (to observe entropy source directly). Mask */
#define SILEX_RNG_DATA_CONTROL_CONDBYPASS(value) (SILEX_RNG_DATA_CONTROL_CONDBYPASS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_CONDBYPASS_Pos)) /* Assigment of value for CONDBYPASS in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_INTENREP_Pos   _UINT32_(4)                                          /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for Repetition Count Test failure. Position */
#define SILEX_RNG_DATA_CONTROL_INTENREP_Msk   (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_INTENREP_Pos) /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for Repetition Count Test failure. Mask */
#define SILEX_RNG_DATA_CONTROL_INTENREP(value) (SILEX_RNG_DATA_CONTROL_INTENREP_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_INTENREP_Pos)) /* Assigment of value for INTENREP in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_INTENPROP_Pos  _UINT32_(5)                                          /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for Adaptive Proportion Test failure (1024-sample window). Position */
#define SILEX_RNG_DATA_CONTROL_INTENPROP_Msk  (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_INTENPROP_Pos) /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for Adaptive Proportion Test failure (1024-sample window). Mask */
#define SILEX_RNG_DATA_CONTROL_INTENPROP(value) (SILEX_RNG_DATA_CONTROL_INTENPROP_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_INTENPROP_Pos)) /* Assigment of value for INTENPROP in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_INTENFULL_Pos  _UINT32_(7)                                          /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for FIFO full. Position */
#define SILEX_RNG_DATA_CONTROL_INTENFULL_Msk  (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_INTENFULL_Pos) /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for FIFO full. Mask */
#define SILEX_RNG_DATA_CONTROL_INTENFULL(value) (SILEX_RNG_DATA_CONTROL_INTENFULL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_INTENFULL_Pos)) /* Assigment of value for INTENFULL in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_SOFTRST_Pos    _UINT32_(8)                                          /* (SILEX_RNG_DATA_CONTROL) Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically. Position */
#define SILEX_RNG_DATA_CONTROL_SOFTRST_Msk    (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_SOFTRST_Pos) /* (SILEX_RNG_DATA_CONTROL) Software reset: 0: Normal mode, 1: The continuous test, the conditioning function and the FIFO are reset. This bit is not cleared automatically. Mask */
#define SILEX_RNG_DATA_CONTROL_SOFTRST(value) (SILEX_RNG_DATA_CONTROL_SOFTRST_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_SOFTRST_Pos)) /* Assigment of value for SOFTRST in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_INTENPRE_Pos   _UINT32_(9)                                          /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for AIS31 preliminary noise alarm. Position */
#define SILEX_RNG_DATA_CONTROL_INTENPRE_Msk   (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_INTENPRE_Pos) /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for AIS31 preliminary noise alarm. Mask */
#define SILEX_RNG_DATA_CONTROL_INTENPRE(value) (SILEX_RNG_DATA_CONTROL_INTENPRE_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_INTENPRE_Pos)) /* Assigment of value for INTENPRE in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_INTENALM_Pos   _UINT32_(10)                                         /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for AIS31 noise alarm. Position */
#define SILEX_RNG_DATA_CONTROL_INTENALM_Msk   (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_INTENALM_Pos) /* (SILEX_RNG_DATA_CONTROL) Interrupt enable for AIS31 noise alarm. Mask */
#define SILEX_RNG_DATA_CONTROL_INTENALM(value) (SILEX_RNG_DATA_CONTROL_INTENALM_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_INTENALM_Pos)) /* Assigment of value for INTENALM in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_FORCEACTIVEROS_Pos _UINT32_(11)                                         /* (SILEX_RNG_DATA_CONTROL) Force oscillators to run when FIFO is full. Position */
#define SILEX_RNG_DATA_CONTROL_FORCEACTIVEROS_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_FORCEACTIVEROS_Pos) /* (SILEX_RNG_DATA_CONTROL) Force oscillators to run when FIFO is full. Mask */
#define SILEX_RNG_DATA_CONTROL_FORCEACTIVEROS(value) (SILEX_RNG_DATA_CONTROL_FORCEACTIVEROS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_FORCEACTIVEROS_Pos)) /* Assigment of value for FORCEACTIVEROS in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_HEALTHTESTBYPASS_Pos _UINT32_(12)                                         /* (SILEX_RNG_DATA_CONTROL) Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state. Position */
#define SILEX_RNG_DATA_CONTROL_HEALTHTESTBYPASS_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_HEALTHTESTBYPASS_Pos) /* (SILEX_RNG_DATA_CONTROL) Bypass NIST tests such that the results of the start-up and online test do not affect the FSM state. Mask */
#define SILEX_RNG_DATA_CONTROL_HEALTHTESTBYPASS(value) (SILEX_RNG_DATA_CONTROL_HEALTHTESTBYPASS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_HEALTHTESTBYPASS_Pos)) /* Assigment of value for HEALTHTESTBYPASS in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_AIS31BYPASS_Pos _UINT32_(13)                                         /* (SILEX_RNG_DATA_CONTROL) Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state. Position */
#define SILEX_RNG_DATA_CONTROL_AIS31BYPASS_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_AIS31BYPASS_Pos) /* (SILEX_RNG_DATA_CONTROL) Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state. Mask */
#define SILEX_RNG_DATA_CONTROL_AIS31BYPASS(value) (SILEX_RNG_DATA_CONTROL_AIS31BYPASS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_AIS31BYPASS_Pos)) /* Assigment of value for AIS31BYPASS in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_HEALTHTESTSEL_Pos _UINT32_(14)                                         /* (SILEX_RNG_DATA_CONTROL) Select input to health test module: 0: Before conditioning, 1: After conditioning. Position */
#define SILEX_RNG_DATA_CONTROL_HEALTHTESTSEL_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_HEALTHTESTSEL_Pos) /* (SILEX_RNG_DATA_CONTROL) Select input to health test module: 0: Before conditioning, 1: After conditioning. Mask */
#define SILEX_RNG_DATA_CONTROL_HEALTHTESTSEL(value) (SILEX_RNG_DATA_CONTROL_HEALTHTESTSEL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_HEALTHTESTSEL_Pos)) /* Assigment of value for HEALTHTESTSEL in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_AIS31TESTSEL_Pos _UINT32_(15)                                         /* (SILEX_RNG_DATA_CONTROL) Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning. Position */
#define SILEX_RNG_DATA_CONTROL_AIS31TESTSEL_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_AIS31TESTSEL_Pos) /* (SILEX_RNG_DATA_CONTROL) Select input to the AIS31 test module: 0: Before conditioning, 1: After conditioning. Mask */
#define SILEX_RNG_DATA_CONTROL_AIS31TESTSEL(value) (SILEX_RNG_DATA_CONTROL_AIS31TESTSEL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_AIS31TESTSEL_Pos)) /* Assigment of value for AIS31TESTSEL in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_NB128BITBLOCKS_Pos _UINT32_(16)                                         /* (SILEX_RNG_DATA_CONTROL) Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero. Position */
#define SILEX_RNG_DATA_CONTROL_NB128BITBLOCKS_Msk (_UINT32_(0xF) << SILEX_RNG_DATA_CONTROL_NB128BITBLOCKS_Pos) /* (SILEX_RNG_DATA_CONTROL) Number of 128 bit blocks used in AES-CBCMAC post-processing. This value cannot be zero. Mask */
#define SILEX_RNG_DATA_CONTROL_NB128BITBLOCKS(value) (SILEX_RNG_DATA_CONTROL_NB128BITBLOCKS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_NB128BITBLOCKS_Pos)) /* Assigment of value for NB128BITBLOCKS in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_FIFOWRITESTARTUP_Pos _UINT32_(20)                                         /* (SILEX_RNG_DATA_CONTROL) Enable write of the samples in the FIFO during start-up. Position */
#define SILEX_RNG_DATA_CONTROL_FIFOWRITESTARTUP_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_CONTROL_FIFOWRITESTARTUP_Pos) /* (SILEX_RNG_DATA_CONTROL) Enable write of the samples in the FIFO during start-up. Mask */
#define SILEX_RNG_DATA_CONTROL_FIFOWRITESTARTUP(value) (SILEX_RNG_DATA_CONTROL_FIFOWRITESTARTUP_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CONTROL_FIFOWRITESTARTUP_Pos)) /* Assigment of value for FIFOWRITESTARTUP in the SILEX_RNG_DATA_CONTROL register */
#define SILEX_RNG_DATA_CONTROL_Msk            _UINT32_(0x001FFFBF)                                 /* (SILEX_RNG_DATA_CONTROL) Register Mask  */


/* -------- SILEX_RNG_DATA_FIFOLEVEL : (SILEX Offset: 0x4004) (R/W 32) FIFO level register. -------- */
#define SILEX_RNG_DATA_FIFOLEVEL_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_FIFOLEVEL) FIFO level register.  Reset Value */

#define SILEX_RNG_DATA_FIFOLEVEL_FIFOLEVEL_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_FIFOLEVEL) Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register. Position */
#define SILEX_RNG_DATA_FIFOLEVEL_FIFOLEVEL_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_FIFOLEVEL_FIFOLEVEL_Pos) /* (SILEX_RNG_DATA_FIFOLEVEL) Number of 32 bits words of random available in the FIFO. Any write to this register clears the FullInt flag in the Status register. Mask */
#define SILEX_RNG_DATA_FIFOLEVEL_FIFOLEVEL(value) (SILEX_RNG_DATA_FIFOLEVEL_FIFOLEVEL_Msk & (_UINT32_(value) << SILEX_RNG_DATA_FIFOLEVEL_FIFOLEVEL_Pos)) /* Assigment of value for FIFOLEVEL in the SILEX_RNG_DATA_FIFOLEVEL register */
#define SILEX_RNG_DATA_FIFOLEVEL_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_FIFOLEVEL) Register Mask  */


/* -------- SILEX_RNG_DATA_FIFOTHRESHOLD : (SILEX Offset: 0x4008) (R/W 32) FIFO threshold register. -------- */
#define SILEX_RNG_DATA_FIFOTHRESHOLD_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_FIFOTHRESHOLD) FIFO threshold register.  Reset Value */

#define SILEX_RNG_DATA_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_FIFOTHRESHOLD) FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks. Position */
#define SILEX_RNG_DATA_FIFOTHRESHOLD_FIFOTHRESHOLD_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos) /* (SILEX_RNG_DATA_FIFOTHRESHOLD) FIFO level below which the module leaves the idle state to refill the FIFO, expressed in number of 128bit blocks. Mask */
#define SILEX_RNG_DATA_FIFOTHRESHOLD_FIFOTHRESHOLD(value) (SILEX_RNG_DATA_FIFOTHRESHOLD_FIFOTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_DATA_FIFOTHRESHOLD_FIFOTHRESHOLD_Pos)) /* Assigment of value for FIFOTHRESHOLD in the SILEX_RNG_DATA_FIFOTHRESHOLD register */
#define SILEX_RNG_DATA_FIFOTHRESHOLD_Msk      _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_FIFOTHRESHOLD) Register Mask  */


/* -------- SILEX_RNG_DATA_FIFODEPTH : (SILEX Offset: 0x400C) ( R/ 32) FIFO depth register. -------- */
#define SILEX_RNG_DATA_FIFODEPTH_RESETVALUE   _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_FIFODEPTH) FIFO depth register.  Reset Value */

#define SILEX_RNG_DATA_FIFODEPTH_FIFODEPTH_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_FIFODEPTH) Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth. Position */
#define SILEX_RNG_DATA_FIFODEPTH_FIFODEPTH_Msk (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_FIFODEPTH_FIFODEPTH_Pos) /* (SILEX_RNG_DATA_FIFODEPTH) Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth. Mask */
#define SILEX_RNG_DATA_FIFODEPTH_FIFODEPTH(value) (SILEX_RNG_DATA_FIFODEPTH_FIFODEPTH_Msk & (_UINT32_(value) << SILEX_RNG_DATA_FIFODEPTH_FIFODEPTH_Pos)) /* Assigment of value for FIFODEPTH in the SILEX_RNG_DATA_FIFODEPTH register */
#define SILEX_RNG_DATA_FIFODEPTH_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_FIFODEPTH) Register Mask  */


/* -------- SILEX_RNG_DATA_KEY0 : (SILEX Offset: 0x4010) (R/W 32) Key register (MSB). -------- */
#define SILEX_RNG_DATA_KEY0_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_KEY0) Key register (MSB).  Reset Value */

#define SILEX_RNG_DATA_KEY0_KEY0_Pos          _UINT32_(0)                                          /* (SILEX_RNG_DATA_KEY0) Key register (MSB). Position */
#define SILEX_RNG_DATA_KEY0_KEY0_Msk          (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_KEY0_KEY0_Pos) /* (SILEX_RNG_DATA_KEY0) Key register (MSB). Mask */
#define SILEX_RNG_DATA_KEY0_KEY0(value)       (SILEX_RNG_DATA_KEY0_KEY0_Msk & (_UINT32_(value) << SILEX_RNG_DATA_KEY0_KEY0_Pos)) /* Assigment of value for KEY0 in the SILEX_RNG_DATA_KEY0 register */
#define SILEX_RNG_DATA_KEY0_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_KEY0) Register Mask  */


/* -------- SILEX_RNG_DATA_KEY1 : (SILEX Offset: 0x4014) (R/W 32) Key register. -------- */
#define SILEX_RNG_DATA_KEY1_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_KEY1) Key register.  Reset Value */

#define SILEX_RNG_DATA_KEY1_KEY1_Pos          _UINT32_(0)                                          /* (SILEX_RNG_DATA_KEY1) Key register. Position */
#define SILEX_RNG_DATA_KEY1_KEY1_Msk          (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_KEY1_KEY1_Pos) /* (SILEX_RNG_DATA_KEY1) Key register. Mask */
#define SILEX_RNG_DATA_KEY1_KEY1(value)       (SILEX_RNG_DATA_KEY1_KEY1_Msk & (_UINT32_(value) << SILEX_RNG_DATA_KEY1_KEY1_Pos)) /* Assigment of value for KEY1 in the SILEX_RNG_DATA_KEY1 register */
#define SILEX_RNG_DATA_KEY1_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_KEY1) Register Mask  */


/* -------- SILEX_RNG_DATA_KEY2 : (SILEX Offset: 0x4018) (R/W 32) Key register. -------- */
#define SILEX_RNG_DATA_KEY2_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_KEY2) Key register.  Reset Value */

#define SILEX_RNG_DATA_KEY2_KEY2_Pos          _UINT32_(0)                                          /* (SILEX_RNG_DATA_KEY2) Key register. Position */
#define SILEX_RNG_DATA_KEY2_KEY2_Msk          (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_KEY2_KEY2_Pos) /* (SILEX_RNG_DATA_KEY2) Key register. Mask */
#define SILEX_RNG_DATA_KEY2_KEY2(value)       (SILEX_RNG_DATA_KEY2_KEY2_Msk & (_UINT32_(value) << SILEX_RNG_DATA_KEY2_KEY2_Pos)) /* Assigment of value for KEY2 in the SILEX_RNG_DATA_KEY2 register */
#define SILEX_RNG_DATA_KEY2_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_KEY2) Register Mask  */


/* -------- SILEX_RNG_DATA_KEY3 : (SILEX Offset: 0x401C) (R/W 32) Key register (LSB). -------- */
#define SILEX_RNG_DATA_KEY3_RESETVALUE        _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_KEY3) Key register (LSB).  Reset Value */

#define SILEX_RNG_DATA_KEY3_KEY3_Pos          _UINT32_(0)                                          /* (SILEX_RNG_DATA_KEY3) Key register (LSB). Position */
#define SILEX_RNG_DATA_KEY3_KEY3_Msk          (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_KEY3_KEY3_Pos) /* (SILEX_RNG_DATA_KEY3) Key register (LSB). Mask */
#define SILEX_RNG_DATA_KEY3_KEY3(value)       (SILEX_RNG_DATA_KEY3_KEY3_Msk & (_UINT32_(value) << SILEX_RNG_DATA_KEY3_KEY3_Pos)) /* Assigment of value for KEY3 in the SILEX_RNG_DATA_KEY3 register */
#define SILEX_RNG_DATA_KEY3_Msk               _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_KEY3) Register Mask  */


/* -------- SILEX_RNG_DATA_TESTDATA : (SILEX Offset: 0x4020) ( /W 32) Test data register. -------- */
#define SILEX_RNG_DATA_TESTDATA_RESETVALUE    _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_TESTDATA) Test data register.  Reset Value */

#define SILEX_RNG_DATA_TESTDATA_TESTDATA_Pos  _UINT32_(0)                                          /* (SILEX_RNG_DATA_TESTDATA) Test data register. Position */
#define SILEX_RNG_DATA_TESTDATA_TESTDATA_Msk  (_UINT32_(0xFFFFFFFF) << SILEX_RNG_DATA_TESTDATA_TESTDATA_Pos) /* (SILEX_RNG_DATA_TESTDATA) Test data register. Mask */
#define SILEX_RNG_DATA_TESTDATA_TESTDATA(value) (SILEX_RNG_DATA_TESTDATA_TESTDATA_Msk & (_UINT32_(value) << SILEX_RNG_DATA_TESTDATA_TESTDATA_Pos)) /* Assigment of value for TESTDATA in the SILEX_RNG_DATA_TESTDATA register */
#define SILEX_RNG_DATA_TESTDATA_Msk           _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_TESTDATA) Register Mask  */


