Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/silex.h
#define SILEX_RNG_DATA_CLKDIV_CLKDIV_Pos      _UINT32_(0)                                          /* (SILEX_RNG_DATA_CLKDIV) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Position */
#define SILEX_RNG_DATA_CLKDIV_CLKDIV_Msk      (_UINT32_(0xFF) << SILEX_RNG_DATA_CLKDIV_CLKDIV_Pos) /* (SILEX_RNG_DATA_CLKDIV) Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1). Mask */
#define SILEX_RNG_DATA_CLKDIV_CLKDIV(value)   (SILEX_RNG_DATA_CLKDIV_CLKDIV_Msk & (_UINT32_(value) << SILEX_RNG_DATA_CLKDIV_CLKDIV_Pos)) /* Assigment of value for CLKDIV in the SILEX_RNG_DATA_CLKDIV register */
#define SILEX_RNG_DATA_CLKDIV_Msk             _UINT32_(0x000000FF)                                 /* (SILEX_RNG_DATA_CLKDIV) Register Mask  */


/* -------- SILEX_RNG_DATA_AIS31CONF0 : (SILEX Offset: 0x4048) (R/W 32) AIS31 configuration register 0. -------- */
#define SILEX_RNG_DATA_AIS31CONF0_RESETVALUE  _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_AIS31CONF0) AIS31 configuration register 0.  Reset Value */

#define SILEX_RNG_DATA_AIS31CONF0_STARTUPTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_AIS31CONF0) Start-up test threshold. Position */
#define SILEX_RNG_DATA_AIS31CONF0_STARTUPTHRESHOLD_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31CONF0_STARTUPTHRESHOLD_Pos) /* (SILEX_RNG_DATA_AIS31CONF0) Start-up test threshold. Mask */
#define SILEX_RNG_DATA_AIS31CONF0_STARTUPTHRESHOLD(value) (SILEX_RNG_DATA_AIS31CONF0_STARTUPTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31CONF0_STARTUPTHRESHOLD_Pos)) /* Assigment of value for STARTUPTHRESHOLD in the SILEX_RNG_DATA_AIS31CONF0 register */
#define SILEX_RNG_DATA_AIS31CONF0_ONLINETHRESHOLD_Pos _UINT32_(16)                                         /* (SILEX_RNG_DATA_AIS31CONF0) Online threshold. Position */
#define SILEX_RNG_DATA_AIS31CONF0_ONLINETHRESHOLD_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31CONF0_ONLINETHRESHOLD_Pos) /* (SILEX_RNG_DATA_AIS31CONF0) Online threshold. Mask */
#define SILEX_RNG_DATA_AIS31CONF0_ONLINETHRESHOLD(value) (SILEX_RNG_DATA_AIS31CONF0_ONLINETHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31CONF0_ONLINETHRESHOLD_Pos)) /* Assigment of value for ONLINETHRESHOLD in the SILEX_RNG_DATA_AIS31CONF0 register */
#define SILEX_RNG_DATA_AIS31CONF0_Msk         _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_AIS31CONF0) Register Mask  */


/* -------- SILEX_RNG_DATA_AIS31CONF1 : (SILEX Offset: 0x404C) (R/W 32) AIS31 configuration register 1. -------- */
#define SILEX_RNG_DATA_AIS31CONF1_RESETVALUE  _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_AIS31CONF1) AIS31 configuration register 1.  Reset Value */

#define SILEX_RNG_DATA_AIS31CONF1_ONLINEREPTHRESHOLD_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_AIS31CONF1) Online repeat threshold. Position */
#define SILEX_RNG_DATA_AIS31CONF1_ONLINEREPTHRESHOLD_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31CONF1_ONLINEREPTHRESHOLD_Pos) /* (SILEX_RNG_DATA_AIS31CONF1) Online repeat threshold. Mask */
#define SILEX_RNG_DATA_AIS31CONF1_ONLINEREPTHRESHOLD(value) (SILEX_RNG_DATA_AIS31CONF1_ONLINEREPTHRESHOLD_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31CONF1_ONLINEREPTHRESHOLD_Pos)) /* Assigment of value for ONLINEREPTHRESHOLD in the SILEX_RNG_DATA_AIS31CONF1 register */
#define SILEX_RNG_DATA_AIS31CONF1_HEXPECTEDVALUE_Pos _UINT32_(16)                                         /* (SILEX_RNG_DATA_AIS31CONF1) Expected history value. Position */
#define SILEX_RNG_DATA_AIS31CONF1_HEXPECTEDVALUE_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31CONF1_HEXPECTEDVALUE_Pos) /* (SILEX_RNG_DATA_AIS31CONF1) Expected history value. Mask */
#define SILEX_RNG_DATA_AIS31CONF1_HEXPECTEDVALUE(value) (SILEX_RNG_DATA_AIS31CONF1_HEXPECTEDVALUE_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31CONF1_HEXPECTEDVALUE_Pos)) /* Assigment of value for HEXPECTEDVALUE in the SILEX_RNG_DATA_AIS31CONF1 register */
#define SILEX_RNG_DATA_AIS31CONF1_Msk         _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_AIS31CONF1) Register Mask  */


/* -------- SILEX_RNG_DATA_AIS31CONF2 : (SILEX Offset: 0x4050) (R/W 32) AIS31 configuration register 2. -------- */
#define SILEX_RNG_DATA_AIS31CONF2_RESETVALUE  _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_AIS31CONF2) AIS31 configuration register 2.  Reset Value */

#define SILEX_RNG_DATA_AIS31CONF2_HMIN_Pos    _UINT32_(0)                                          /* (SILEX_RNG_DATA_AIS31CONF2) Minimum allowed history value. Position */
#define SILEX_RNG_DATA_AIS31CONF2_HMIN_Msk    (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31CONF2_HMIN_Pos) /* (SILEX_RNG_DATA_AIS31CONF2) Minimum allowed history value. Mask */
#define SILEX_RNG_DATA_AIS31CONF2_HMIN(value) (SILEX_RNG_DATA_AIS31CONF2_HMIN_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31CONF2_HMIN_Pos)) /* Assigment of value for HMIN in the SILEX_RNG_DATA_AIS31CONF2 register */
#define SILEX_RNG_DATA_AIS31CONF2_HMAX_Pos    _UINT32_(16)                                         /* (SILEX_RNG_DATA_AIS31CONF2) Maximum allowed history value. Position */
#define SILEX_RNG_DATA_AIS31CONF2_HMAX_Msk    (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31CONF2_HMAX_Pos) /* (SILEX_RNG_DATA_AIS31CONF2) Maximum allowed history value. Mask */
#define SILEX_RNG_DATA_AIS31CONF2_HMAX(value) (SILEX_RNG_DATA_AIS31CONF2_HMAX_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31CONF2_HMAX_Pos)) /* Assigment of value for HMAX in the SILEX_RNG_DATA_AIS31CONF2 register */
#define SILEX_RNG_DATA_AIS31CONF2_Msk         _UINT32_(0xFFFFFFFF)                                 /* (SILEX_RNG_DATA_AIS31CONF2) Register Mask  */


/* -------- SILEX_RNG_DATA_AIS31STATUS : (SILEX Offset: 0x4054) (R/W 32) AIS31 status register. -------- */
#define SILEX_RNG_DATA_AIS31STATUS_RESETVALUE _UINT32_(0x00)                                       /*  (SILEX_RNG_DATA_AIS31STATUS) AIS31 status register.  Reset Value */

#define SILEX_RNG_DATA_AIS31STATUS_NUMPRELIMALARMS_Pos _UINT32_(0)                                          /* (SILEX_RNG_DATA_AIS31STATUS) Number of preliminary noise alarms since counter was last cleared. Position */
#define SILEX_RNG_DATA_AIS31STATUS_NUMPRELIMALARMS_Msk (_UINT32_(0xFFFF) << SILEX_RNG_DATA_AIS31STATUS_NUMPRELIMALARMS_Pos) /* (SILEX_RNG_DATA_AIS31STATUS) Number of preliminary noise alarms since counter was last cleared. Mask */
#define SILEX_RNG_DATA_AIS31STATUS_NUMPRELIMALARMS(value) (SILEX_RNG_DATA_AIS31STATUS_NUMPRELIMALARMS_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31STATUS_NUMPRELIMALARMS_Pos)) /* Assigment of value for NUMPRELIMALARMS in the SILEX_RNG_DATA_AIS31STATUS register */
#define SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMRNG_Pos _UINT32_(16)                                         /* (SILEX_RNG_DATA_AIS31STATUS) Last preliminary noise alarm occurred due to history value out of range. Position */
#define SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMRNG_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMRNG_Pos) /* (SILEX_RNG_DATA_AIS31STATUS) Last preliminary noise alarm occurred due to history value out of range. Mask */
#define SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMRNG(value) (SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMRNG_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMRNG_Pos)) /* Assigment of value for PRELIMNOISEALARMRNG in the SILEX_RNG_DATA_AIS31STATUS register */
#define SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMREP_Pos _UINT32_(17)                                         /* (SILEX_RNG_DATA_AIS31STATUS) Last preliminary noise alarm occurred due to consecutive high X**2. Position */
#define SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMREP_Msk (_UINT32_(0x1) << SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMREP_Pos) /* (SILEX_RNG_DATA_AIS31STATUS) Last preliminary noise alarm occurred due to consecutive high X**2. Mask */
#define SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMREP(value) (SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMREP_Msk & (_UINT32_(value) << SILEX_RNG_DATA_AIS31STATUS_PRELIMNOISEALARMREP_Pos)) /* Assigment of value for PRELIMNOISEALARMREP in the SILEX_RNG_DATA_AIS31STATUS register */
#define SILEX_RNG_DATA_AIS31STATUS_Msk        _UINT32_(0x0003FFFF)                                 /* (SILEX_RNG_DATA_AIS31STATUS) Register Mask  */


